
 Процедура ДобавитьВДокументКонтактноеЛицо(Форма)  Экспорт
	 // {{ Мымрин С. В.
	 ИмяФормы = Форма.ИмяФормы;
	 Если ИмяФормы =  "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма); 
		ВставитьЭлементыДляСкидки(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
 	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ПередЭлементом = Форма.Элементы.Основание;
		ВставитьПолеКонтактноеЛицо(Форма, ПередЭлементом);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ПередЭлементом = Форма.Элементы.СуммаДокумента;
		ВставитьПолеКонтактноеЛицо(Форма, ПередЭлементом);
	КонецЕсли;
   //Мымрин С. В.}}
КонецПроцедуры

 Процедура ДобавитьПолеКонтактноеЛицо(Форма)  
	// {{ Мымрин С. В. 
	ПолеВвода = форма.Элементы.Добавить("КонтактноеЛицо", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.МС_КонтактныеЛица";	 
	//Мымрин С. В.}}
 КонецПроцедуры

 
 Процедура ВставитьПолеКонтактноеЛицо(Форма, ПередЭлементом)
    // {{ Мымрин С. В.
 	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, ПередЭлементом);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.МС_КонтактныеЛица";	 
   //Мымрин С. В.}}
 КонецПроцедуры
 
 
 Процедура ВставитьЭлементыДляСкидки(Форма)
	 // {{ Мымрин С. В.
	 
	 // Добавляем команду
	 НоваяКоманда = Форма.Команды.Добавить("МС_ПересчитатьТаблицу");
	 НоваяКоманда.Заголовок = "Пересчитать таблицу";
	 НоваяКоманда.Действие = "МС_ПересчитатьТаблицу";
	 
	 // Добавляем элементы на форму
	 Группа = Форма.Элементы.Добавить("МС_Скидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	 Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	 Группа.ОтображатьЗаголовок = Ложь;
	 Группа.РастягиватьПоГоризонтали = Истина;  
	 Группа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	 Группа.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	 
	 ПолеВвода = Форма.Элементы.Добавить("МС_СогласованнаяСкидка", Тип("ПолеФормы"),Группа);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	 ПолеВвода.МаксимальноеЗначение = 100;
	 ПолеВвода.ПутьКДанным = "Объект.МС_СогласованнаяСкидка";	
	 ПолеВвода.УстановитьДействие("ПриИзменении", "МС_ВыполнитьДействиеПриИзмененииДанных");
	 
	 МояКартинка = БиблиотекаКартинок.Обновить;
	 Кнопка = Форма.Элементы.Добавить("МС_ПересчитатьТаблицу", Тип("КнопкаФормы"), Группа);
	 Кнопка.Заголовок = "ПересчитатьТаблицу"; 
	 Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	 Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	 Кнопка.Картинка = МояКартинка;
	 Кнопка.ИмяКоманды = "МС_ПересчитатьТаблицу";	
	
    //Мымрин С. В.}}
 КонецПроцедуры
 